<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"e95f387e9c6e8115594840096efcd79e77509214cd23bca3e82356d512b42bc9","plan_job_ref":"Job Pull Request Checks #3671 at https://github.com/GSA-TTS/FAC/actions/runs/10963199764","plan_out_hash":"e77593af1d1a74849a500d4cebe262d8a8fe7286000b81ee8f55f5ee455863a2","plan_hash":"b160b14cd8f60cd5c5ec013d8fd59b4b772acf25382ab3b6ecdae3cd39d0306c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["sandbox"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../sandbox/init.sh"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.main-tf will be created
+   resource "local_file" "main-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            # Add resources to this module describing what you want in the corresponding 
            # space in cloud.gov. You should probably just reference a shared module as in the
            # example below to keep consistency across spaces, but you can also vary the 
            # content for each environment as needed.
            
            module "sandbox" {
              source        = "../shared/modules/env"
              cf_space_name = "sandbox"
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/sandbox.tf-example"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.51.3"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["sandbox"].local_file.variables-tf will be created
+   resource "local_file" "variables-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            variable "cf_user" {
              type        = string
              description = "cloud.gov deployer account user"
            }
            
            variable "cf_password" {
              type        = string
              description = "secret; cloud.gov deployer account password"
              sensitive   = true
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../sandbox/variables-managed.tf"
+       id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3671](https://github.com/GSA-TTS/FAC/actions/runs/10963199764)